"""
6. Необходимо создать (не программно) текстовый файл,
где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

dict_subjects = {}
with open('learn.txt') as f:
    for line in f:
        line = line.split()
        subject = line[0][:len(line[0])-1]
        hours = ([int(val[:val.find('(')]) for val in line if val.find('(') != -1])
        dict_subjects[subject] = sum(hours)
print(dict_subjects)